export const ogeTask1Questions = [
  {
    id: 1,
    question:
      "В кодировке **КОИ1-8** каждый символ кодируется 8 битами. Андрей написал текст (в нем нет лишних пробелов): \n \n «Обь, Лена, Волга, Москва, Макензи, Амазонка  — реки». \n \n Ученик вычеркнул из списка название одной из рек. Заодно он вычеркнул ставшие лишними запятые и пробелы  — два пробела не должны идти подряд. \n  При этом размер нового предложения в данной кодировке оказался на 8 байтов меньше, чем размер исходного предложения. Напишите в ответе вычеркнутое название реки.",
    correctAnswer: "Москва",
  },
  {
    id: 2,
    question:
      "В кодировке КОИ-8 каждый символ кодируется 8 битами. Андрей написал текст (в нем нет лишних пробелов):  \n \n «Чад, Куба, Катар, Швеция, Эстония, Танзания, Сальвадор  — страны». \n \n Ученик вычеркнул из списка название одной из стран. Заодно он вычеркнул ставшие лишними запятые и пробелы  — два пробела не должны идти подряд. \n При этом размер нового предложения в данной кодировке оказался на 11 байтов меньше, чем размер исходного предложения. Напишите в ответе вычеркнутое название страны.",
    correctAnswer: "Сальвадор",
  },
  {
    id: 3,
    question:
      "В кодировке КОИ-8 каждый символ кодируется 8 битами. Паша написал текст (в нем нет лишних пробелов): \n \n «Аки, Бали, Банда, Сибуян, Камотес, Лабрадор, Линкольна  — моря». \n \n Ученик вычеркнул из списка название одного из морей. Заодно он вычеркнул ставшие лишними запятые и пробелы  — два пробела не должны идти подряд. \n При этом размер нового предложения в данной кодировке оказался на 7 байтов меньше, чем размер исходного предложения. Напишите в ответе вычеркнутое название моря.",
    correctAnswer: "Банда",
  },
  {
    id: 4,
    question:
      "В кодировке КОИ-8 каждый символ кодируется 8 битами. Лена написала текст (в нем нет лишних пробелов):  \n \n  «Ява, Куба, Лусон, Маражо, Суматра, Сулавеси, Эспаньола  — острова». \n \n Ученица вычеркнула из списка название одного из островов. Заодно она вычеркнула ставшие лишними запятые и пробелы  — два пробела не должны идти подряд. \n При этом размер нового предложения в данной кодировке оказался на 9 байтов меньше, чем размер исходного предложения. Напишите в ответе вычеркнутое название острова.",
    correctAnswer: "Суматра",
  },
  {
    id: 5,
    question:
      "В кодировке КОИ-8 каждый символ кодируется 8 битами. Аня написала текст (в нем нет лишних пробелов): \n \n «ерш, Щука, Бычок, Карась, Гимнура, Долгопер  — рыбы». \n \n Ученик вычеркнул из списка название одной из рыб. Заодно он вычеркнул ставшие лишними запятые и пробелы  — два пробела не должны идти подряд. \n При этом размер нового предложения в данной кодировке оказался на 10 байтов меньше, чем размер исходного предложения. Напишите в ответе вычеркнутое название рыбы.",
    correctAnswer: "Долгопер",
  },
  {
    id: 6,
    question:
      "В одной из кодировок Unicode каждый символ кодируется 16 битами. Вова написал текст (в нем нет лишних пробелов): \n \n «еж, лев, слон, олень, тюлень, носорог, крокодил, аллигатор  — дикие животные». \n \n Ученик вычеркнул из списка название одного из животных. Заодно он вычеркнул ставшие лишними запятые и пробелы  — два пробела не должны идти подряд. \n При этом размер нового предложения в данной кодировке оказался на 16 байт меньше, чем размер исходного предложения. Напишите в ответе вычеркнутое название животного.",
    correctAnswer: "тюлень",
  },
  {
    id: 7,
    question:
      "В одной из кодировок Unicode каждый символ кодируется 16 битами. Ваня написал текст (в нем нет лишних пробелов): \n \n «D, Io, Ada, Java, Swift, Python, ColdFusion  — языки программирования». \n \n Ученик вычеркнул из списка название одного из языков программирования. Заодно он вычеркнул ставшие лишними запятые и пробелы  — два пробела не должны идти подряд. \n При этом размер нового предложения в данной кодировке оказался на 10 байт меньше, чем размер исходного предложения. Напишите в ответе вычеркнутое название языка программирования.",
    correctAnswer: "Ada",
  },
  {
    id: 8,
    question:
      "В одной из кодировок UTF-16 каждый символ кодируется 16 битами. Гриша написал текст (в нем нет лишних пробелов): \n \n «Лось, хомяк, косуля, кенгуру, капибара, бинтуронг, гиппопотам  — животные». \n \n Ученик вычеркнул из списка название одного из животных. Заодно он вычеркнул ставшие лишними запятые и пробелы  — два пробела не должны идти подряд. \n При этом размер нового предложения в данной кодировке оказался на 22 байта меньше, чем размер исходного предложения. Напишите в ответе вычеркнутое название животного.",
    correctAnswer: "бинтуронг",
  },
  {
    id: 9,
    question:
      "В кодировке UTF-16 каждый символ кодируется 16 битами. Илья написал текст (в нем нет лишних пробелов): \n \n «айва, хурма, яблоко, гуарана, апельсин, мангостан  — фрукты». \n \n Ученик вычеркнул из списка название одного из фруктов. Заодно он вычеркнул ставшие лишними запятые и пробелы  — два пробела не должны идти подряд. \n При этом размер нового предложения в данной кодировке оказался на 20 байт меньше, чем размер исходного предложения. Напишите в ответе вычеркнутое название фрукта.",
    correctAnswer: "апельсин",
  },
  {
    id: 10,
    question:
      "В одной из кодировок Unicode каждый символ кодируется 16 битами. Вова написал текст (в нем нет лишних пробелов): \n \n «Школьные предметы: ОБЖ, химия, физика, алгебра, биология, география, литература, информатика». \n \n Учение удалил из списка название одного предмета, а также лишние запятую и пробел  — два пробела не должны идти подряд. \n При этом размер нового предложения в данной кодировке оказался на 16 байт меньше, чем размер исходного предложения. Напишите в ответе вычеркнутое название предмета.",
    correctAnswer: "физика",
  },
];

export const ogeTask2Questions = [
  {
    id: 1,
    question:
      "Вася и Петя играли в шпионов и кодировали сообщения собственным шифром. Фрагмент кодовой таблицы приведен ниже. \n \n Расшифруйте сообщение, если известно, что буквы в нем не повторяются: \n \n +~+~+@@~+ \n \n Запишите в ответе расшифрованное сообщение.",
    correctAnswer: "ОЛИМП",
    additionalInfo: {
      type: "table",
      data: [
        { key: "К", value: "@+" },
        { key: "Л", value: "~+" },
        { key: "М", value: "+@" },
        { key: "П", value: "@~+" },
        { key: "О", value: "+" },
        { key: "И", value: "~" },
      ],
    },
  },
  {
    id: 2,
    question:
      "Вася и Петя играли в шпионов и кодировали сообщения собственным шифром. Фрагмент кодовой таблицы приведен ниже. \n \n Расшифруйте сообщение, если известно, что буквы в нем не повторяются: \n \n #~#~#++~# \n \n Запишите в ответе расшифрованное сообщение.",
    correctAnswer: "ПОЛЕТ",
    additionalInfo: {
      type: "table",
      data: [
        { key: "А", value: "+#" },
        { key: "Е", value: "#+" },
        { key: "Л", value: "~" },
        { key: "П", value: "#" },
        { key: "Т", value: "+~#" },
        { key: "О", value: "~#" },
      ],
    },
  },
  {
    id: 3,
    question:
      "От разведчика была получена следующая шифрованная радиограмма, переданная с использованием азбуки Морзе: \n \n – • – • – • – – • • – • • – • – • • \n \n При передаче радиограммы было потеряно разбиение на буквы, но известно, что в радиограмме могли использоваться только следующие буквы. \n \n Расшифруйте радиограмму. Запишите в ответе расшифрованную радиограмму.",
    correctAnswer: "ННКНЛКИ",
    additionalInfo: {
      type: "table",
      data: [
        { key: "Н", value: "– •" },
        { key: "К", value: "– • –" },
        { key: "И", value: "• •" },
        { key: "Л", value: "• – • •" },
        { key: "М", value: "– –" },
      ],
    },
  },
  {
    id: 4,
    question:
      "От разведчика была получена следующая шифрованная радиограмма, переданная с использованием азбуки Морзе: \n \n • – – • • • – • • – – • • – • • – • – – \n \n При передаче радиограммы было потеряно разбиение на буквы, но известно, что в радиограмме могли использоваться только следующие буквы. \n \n Расшифруйте радиограмму. Запишите в ответе расшифрованную радиограмму.",
    correctAnswer: "АДЛТДДТАТ",
    additionalInfo: {
      type: "table",
      data: [
        { key: "А", value: "• –" },
        { key: "Д", value: "– • •" },
        { key: "Л", value: "• – • •" },
        { key: "Т", value: "–" },
        { key: "Ж", value: "• • • –" },
      ],
    },
  },
  {
    id: 5,
    question:
      "От разведчика была получена следующая шифрованная радиограмма, переданная с использованием азбуки Морзе: \n \n – – • – – – – – • • • – – – • – • – \n \n При передаче радиограммы было потеряно разбиение на буквы, но известно, что в радиограмме могли использоваться только следующие буквы. \n \n Расшифруйте радиограмму. Запишите в ответе расшифрованную радиограмму.",
    correctAnswer: "МАМГЮКА",
    additionalInfo: {
      type: "table",
      data: [
        { key: "А", value: "• –" },
        { key: "Г", value: "– • •" },
        { key: "М", value: "– –" },
        { key: "К", value: "– • –" },
        { key: "Ю", value: "• • – –" },
      ],
    },
  },
  {
    id: 6,
    question:
      "Валя шифрует русские слова (последовательности букв), записывая вместо каждой буквы ее код. \n \n Некоторые цепочки можно расшифровать не одним способом. Например, 00010101 может означать не только СКА, но и СНК. \n \n Даны три кодовые цепочки: \n \n 10111101 \n \n 1010110 \n \n 10111000 \n \n Найдите среди них ту, которая имеет только одну расшифровку, и запишите в ответе расшифрованное слово.",
    correctAnswer: "НОС",
    additionalInfo: {
      type: "table",
      data: [
        { key: "А", value: "01" },
        { key: "Д", value: "100" },
        { key: "К", value: "101" },
        { key: "Н", value: "10" },
        { key: "О", value: "111" },
        { key: "С", value: "000" },
      ],
    },
  },
  {
    id: 7,
    question:
      "Сообщение передается шифром. В нем присутствуют только буквы из приведенного фрагмента кодовой таблицы. \n \n Определите, какое сообщение закодировано в строчке 1011011. В ответ запишите последовательность букв без запятых и других знаков препинания.",
    correctAnswer: "ЛАК",
    additionalInfo: {
      type: "table",
      data: [
        { key: "Ш", value: "01" },
        { key: "К", value: "11" },
        { key: "О", value: "100" },
        { key: "Л", value: "101" },
        { key: "А", value: "10" },
      ],
    },
  },
  {
    id: 8,
    question:
      "Валя шифрует русские слова (последовательности букв), записывая вместо каждой буквы ее код. \n \n Некоторые шифровки можно расшифровать не одним способом. Например, 00101001 может означать не только УРА, но и УАУ. \n \n Даны три кодовые цепочки: \n \n 0100100101 \n \n 011011111100 \n \n 0100110001 \n \n Найдите среди них ту, которая имеет только одну расшифровку, и запишите в ответе расшифрованное слово.",
    correctAnswer: "ВВОД",
    additionalInfo: {
      type: "table",
      data: [
        { key: "А", value: "01", q: "00" },
        { key: "В", value: "011" },
        { key: "Д", value: "100" },
        { key: "О", value: "111" },
        { key: "Р", value: "010" },
        { key: "У", value: "001" },
      ],
    },
  },
  {
    id: 9,
    question:
      "Валя шифрует русские слова (последовательности букв), записывая вместо каждой буквы ее код.  \n \n Некоторые шифровки можно расшифровать не одним способом. Например, 00010101 может означать не только СКА, но и СНК. \n \n Даны три кодовые цепочки: \n \n 1010110 \n \n 11110001 \n \n 100000101 \n \n Найдите среди них ту, которая имеет только одну расшифровку, и запишите в ответе расшифрованное слово.",
    correctAnswer: "ОДА",
    additionalInfo: {
      type: "table",
      data: [
        { key: "А", value: "01" },
        { key: "Д", value: "100" },
        { key: "К", value: "101" },
        { key: "Н", value: "10" },
        { key: "О", value: "111" },
        { key: "С", value: "000" },
      ],
    },
  },
  {
    id: 10,
    question:
      "От разведчика было получено следующее сообщение. \n \n **001001110110100** \n \n В этом сообщении зашифрован пароль  — последовательность русских букв. В пароле использовались только буквы А, Б, К, Л, О, С; каждая буква кодировалась двоичным словом по следующей таблице.",
    correctAnswer: "ОБЛАКО",
    additionalInfo: {
      type: "table",
      data: [
        { key: "А", value: "01" },
        { key: "Б", value: "100" },
        { key: "К", value: "101" },
        { key: "Л", value: "111" },
        { key: "О", value: "00" },
        { key: "С", value: "110" },
      ],
    },
  },
];

export const ogeTask3Questions = [
  {
    id: 1,
    question:
      "Напишите наибольшее целое число x, для которого истинно высказывание: \n \n **НЕ** (X <= 15) **И** (X < 20).",
    correctAnswer: "19",
  },
  {
    id: 2,
    question:
      "Напишите наибольшее целое число x, для которого истинно высказывание: \n \n **НЕ** (X <= 10) **И НЕ** (X > 16).",
    correctAnswer: "16",
  },
  {
    id: 3,
    question:
      "Напишите наибольшее целое число x, для которого истинно высказывание: \n \n **НЕ** (X четное) **И НЕ** (X >= 7).",
    correctAnswer: "5",
  },
  {
    id: 4,
    question:
      "Напишите наибольшее целое число x, для которого истинно высказывание: \n \n **НЕ** (X нечетное) **И НЕ** (X >= 10).",
    correctAnswer: "8",
  },
  {
    id: 5,
    question:
      "Напишите наибольшее целое число x, для которого истинно высказывание: \n \n (X >= 6) **И НЕ** (X > 12).",
    correctAnswer: "12",
  },
  {
    id: 6,
    question:
      "Напишите число X, для которого истинно высказывание: \n \n (X < 8) **И НЕ** (X < 7).",
    correctAnswer: "7",
  },
  {
    id: 7,
    question:
      "Для какого целого числа X ЛОЖНО высказывание: \n \n (X > 7) **ИЛИ НЕ** (X > 6).",
    correctAnswer: "7",
  },
  {
    id: 8,
    question:
      "Определите количество натуральных двузначных чисел, для которых истинно логическое выражение: \n \n **НЕ** (x четное) **И НЕ** (x > 67).",
    correctAnswer: "29",
  },
  {
    id: 9,
    question:
      "Напишите наибольшее трехзначное число х, для которого истинно высказывание: \n \n **НЕ** (Первая цифра нечетная) **И** (х делится на 3).",
    correctAnswer: "897",
  },
  {
    id: 10,
    question:
      "Дано четыре числа: 35, 4598, 54321, 24. Для какого из приведенных чисел истинно высказывание: \n \n (Число > 100) **И НЕ** (Число нечетное).В ответ запишите это число.",
    correctAnswer: "4598",
  },
];

export const ogeTask5Questions = [
  {
    id: 1,
    question:
      "У исполнителя Альфа две команды, которым присвоены номера: \n \n **1. прибавь 1;** \n **2. умножь на b** \n \n (b  — неизвестное натуральное число; b ≥ 2). \n \n Выполняя первую из них, Альфа увеличивает число на экране на 1, а выполняя вторую, умножает это число на b. Программа для исполнителя Альфа  — это последовательность номеров команд. Известно, что программа 11211 переводит число 6 в число 82. Определите значение b.",
    correctAnswer: "10",
  },
  {
    id: 2,
    question:
      "У исполнителя Бета две команды, которым присвоены номера: \n \n **1. прибавь 2;** \n **2. умножь на b** \n \n (b  — неизвестное натуральное число; b ≥ 2). \n \n Выполняя первую из них, Бета увеличивает число на экране на 2, а выполняя вторую, умножает это число на b. Программа для исполнителя Бета  — это последовательность номеров команд. Известно, что программа 12111 переводит число 7 в число 51. Определите значение b.",
    correctAnswer: "5",
  },
  {
    id: 3,
    question:
      "У исполнителя Квадратор две команды. которым присвоены номера: \n \n **1.  возведи в квадрат** \n **2.  прибавь 3** \n \n Первая из них возводит число на экране во вторую степень, вторая увеличивает его на 3.Составьте алгоритм получения из числа 1 числа 25, содержащий не более 5 команд. В ответе запишите только номера команд.(Например, 12221  — это алгоритм:возведи в квадратприбавь 3прибавь 3прибавь 3возведи в квадрат,который преобразует число 2 в 169.)Если таких алгоритмов более одного, то запишите любой из них.",
    correctAnswer: "21222",
  },
  {
    id: 4,
    question:
      "У исполнителя Квадратор две команды, которым присвоены номера: \n \n **1. возведи в квадрат** \n **2.  прибавь b** \n \n (b  — неизвестное натуральное число) \n \n Первая из них возводит число на экране во вторую степень, вторая прибавляет к числу b. Программа для исполнителя  — это последовательность номеров команд.Известно, что программа 12212 переводит число 2 в число 37. Определите значение b.",
    correctAnswer: "1",
  },
  {
    id: 5,
    question:
      "У исполнителя Вычислитель две команды, которым присвоены номера: \n \n **1. вычти 1**  \n **2. умножь на 3** \n \n Первая из них уменьшает число на экране на 1, вторая утраивает его.Составьте алгоритм получения из числа 3 числа 53, содержащий не более 5 команд. В ответе запишите только номера команд.(Например, 12121  — это алгоритмвычти 1умножь на 3вычти 1умножь на 3вычти 1,который преобразует число 4 в число 23.)Если таких алгоритмов более одного, то запишите любой из них.",
    correctAnswer: "12221",
  },
  {
    id: 6,
    question:
      "У исполнителя Омега две команды, которым присвоены номера: \n \n **1. прибавь 3;** \n **2. раздели на b** \n \n (b  — неизвестное натуральное число; b ≥ 2). \n \n Выполняя первую из них, Омега увеличивает число на экране на 3, а выполняя вторую, делит это число на b. Программа для исполнителя Омега  — это последовательность номеров команд. Известно, что программа 11211 переводит число 30 в число 12. Определите значение b.",
    correctAnswer: "6",
  },
  {
    id: 7,
    question:
      "У исполнителя Омега две команды, которым присвоены номера: \n \n **1. прибавь 3;** \n **2. раздели на b** \n \n (b  — неизвестное натуральное число; b ≥ 2). \n \n Выполняя первую из них, Омега увеличивает число на экране на 3, а выполняя вторую, делит это число на b. Программа для исполнителя Омега  — это последовательность номеров команд. Известно, что программа 11121 переводит число 46 в число 8. Определите значение b.",
    correctAnswer: "11",
  },
  {
    id: 8,
    question:
      "У исполнителя Делитель две команды, которым присвоены номера: \n \n **1. раздели на 2** \n **2.  вычти 3** \n \n Первая из них уменьшает число на экране в 2 раза, вторая уменьшает его на 3. Исполнитель работает только с натуральными числами. Составьте алгоритм получения из чиcла 76 числа 5, содержащий не более 5 команд. В ответе запишите только номера команд.(Например, 21211– это алгоритм:вычти 3раздели на 2вычти 3раздели на 2раздели на 2,который преобразует число 33 в 3.)Если таких алгоритмов более одного, то запишите любой из них.",
    correctAnswer: "11212",
  },
  {
    id: 9,
    question:
      "У исполнителя Квадратор две команды, которым присвоены номера: \n \n **1. возведи в квадрат** \n **2.  зачеркни справа** \n \n Первая из них возводит число на экране во вторую степень, вторая  — удаляет крайнюю правую цифру числа.Составьте алгоритм получения из числа 3 числа 6, содержащий не более 5 команд. В ответе запишите только номера команд.(Например, 21211  — это алгоритмзачеркни справавозведи в квадратзачеркни справавозведи в квадратвозведи в квадрат,который преобразует число 52 в 16.)Если таких алгоритмов более одного, то запишите любой из них.",
    correctAnswer: "11212",
  },
  {
    id: 10,
    question:
      "У исполнителя Сигма две команды, которым присвоены номера: \n \n **1. прибавь 1;** \n **2. раздели на b** \n \n (b  — неизвестное натуральное число; b ≥ 2). \n \n Выполняя первую из них, Сигма увеличивает число на экране на 1, а выполняя вторую, делит это число на b. Программа для исполнителя Сигма  — это последовательность номеров команд. Известно, что программа 12111 переводит число 63 в число 11. Определите значение b.",
    correctAnswer: "8",
  },
];

export const ogeTask8Questions = [
  {
    id: 1,
    question:
      "Вася и Петя играли в шпионов и кодировали сообщения собственным шифром. Фрагмент кодовой таблицы приведен ниже. \n \n Расшифруйте сообщение, если известно, что буквы в нем не повторяются: \n \n +~+~+@@~+ \n \n Запишите в ответе расшифрованное сообщение.",
    correctAnswer: "ОЛИМП",
    
  },
  {
    id: 2,
    question:
      "Вася и Петя играли в шпионов и кодировали сообщения собственным шифром. Фрагмент кодовой таблицы приведен ниже. \n \n Расшифруйте сообщение, если известно, что буквы в нем не повторяются: \n \n #~#~#++~# \n \n Запишите в ответе расшифрованное сообщение.",
    correctAnswer: "ПОЛЕТ",
    additionalInfo: {
      type: "table",
      data: [
        { key: "А", value: "+#" },
        { key: "Е", value: "#+" },
        { key: "Л", value: "~" },
        { key: "П", value: "#" },
        { key: "Т", value: "+~#" },
        { key: "О", value: "~#" },
      ],
    },
  },
  {
    id: 3,
    question:
      "От разведчика была получена следующая шифрованная радиограмма, переданная с использованием азбуки Морзе: \n \n – • – • – • – – • • – • • – • – • • \n \n При передаче радиограммы было потеряно разбиение на буквы, но известно, что в радиограмме могли использоваться только следующие буквы. \n \n Расшифруйте радиограмму. Запишите в ответе расшифрованную радиограмму.",
    correctAnswer: "ННКНЛКИ",
    additionalInfo: {
      type: "table",
      data: [
        { key: "Н", value: "– •" },
        { key: "К", value: "– • –" },
        { key: "И", value: "• •" },
        { key: "Л", value: "• – • •" },
        { key: "М", value: "– –" },
      ],
    },
  },
  {
    id: 4,
    question:
      "От разведчика была получена следующая шифрованная радиограмма, переданная с использованием азбуки Морзе: \n \n • – – • • • – • • – – • • – • • – • – – \n \n При передаче радиограммы было потеряно разбиение на буквы, но известно, что в радиограмме могли использоваться только следующие буквы. \n \n Расшифруйте радиограмму. Запишите в ответе расшифрованную радиограмму.",
    correctAnswer: "АДЛТДДТАТ",
    additionalInfo: {
      type: "table",
      data: [
        { key: "А", value: "• –" },
        { key: "Д", value: "– • •" },
        { key: "Л", value: "• – • •" },
        { key: "Т", value: "–" },
        { key: "Ж", value: "• • • –" },
      ],
    },
  },
  {
    id: 5,
    question:
      "От разведчика была получена следующая шифрованная радиограмма, переданная с использованием азбуки Морзе: \n \n – – • – – – – – • • • – – – • – • – \n \n При передаче радиограммы было потеряно разбиение на буквы, но известно, что в радиограмме могли использоваться только следующие буквы. \n \n Расшифруйте радиограмму. Запишите в ответе расшифрованную радиограмму.",
    correctAnswer: "МАМГЮКА",
    additionalInfo: {
      type: "table",
      data: [
        { key: "А", value: "• –" },
        { key: "Г", value: "– • •" },
        { key: "М", value: "– –" },
        { key: "К", value: "– • –" },
        { key: "Ю", value: "• • – –" },
      ],
    },
  },
  {
    id: 6,
    question:
      "Валя шифрует русские слова (последовательности букв), записывая вместо каждой буквы ее код. \n \n Некоторые цепочки можно расшифровать не одним способом. Например, 00010101 может означать не только СКА, но и СНК. \n \n Даны три кодовые цепочки: \n \n 10111101 \n \n 1010110 \n \n 10111000 \n \n Найдите среди них ту, которая имеет только одну расшифровку, и запишите в ответе расшифрованное слово.",
    correctAnswer: "НОС",
    additionalInfo: {
      type: "table",
      data: [
        { key: "А", value: "01" },
        { key: "Д", value: "100" },
        { key: "К", value: "101" },
        { key: "Н", value: "10" },
        { key: "О", value: "111" },
        { key: "С", value: "000" },
      ],
    },
  },
  {
    id: 7,
    question:
      "Сообщение передается шифром. В нем присутствуют только буквы из приведенного фрагмента кодовой таблицы. \n \n Определите, какое сообщение закодировано в строчке 1011011. В ответ запишите последовательность букв без запятых и других знаков препинания.",
    correctAnswer: "ЛАК",
    additionalInfo: {
      type: "table",
      data: [
        { key: "Ш", value: "01" },
        { key: "К", value: "11" },
        { key: "О", value: "100" },
        { key: "Л", value: "101" },
        { key: "А", value: "10" },
      ],
    },
  },
  {
    id: 8,
    question:
      "Валя шифрует русские слова (последовательности букв), записывая вместо каждой буквы ее код. \n \n Некоторые шифровки можно расшифровать не одним способом. Например, 00101001 может означать не только УРА, но и УАУ. \n \n Даны три кодовые цепочки: \n \n 0100100101 \n \n 011011111100 \n \n 0100110001 \n \n Найдите среди них ту, которая имеет только одну расшифровку, и запишите в ответе расшифрованное слово.",
    correctAnswer: "ВВОД",
    additionalInfo: {
      type: "table",
      data: [
        { key: "А", value: "01", q: "00" },
        { key: "В", value: "011" },
        { key: "Д", value: "100" },
        { key: "О", value: "111" },
        { key: "Р", value: "010" },
        { key: "У", value: "001" },
      ],
    },
  },
  {
    id: 9,
    question:
      "Валя шифрует русские слова (последовательности букв), записывая вместо каждой буквы ее код.  \n \n Некоторые шифровки можно расшифровать не одним способом. Например, 00010101 может означать не только СКА, но и СНК. \n \n Даны три кодовые цепочки: \n \n 1010110 \n \n 11110001 \n \n 100000101 \n \n Найдите среди них ту, которая имеет только одну расшифровку, и запишите в ответе расшифрованное слово.",
    correctAnswer: "ОДА",
    additionalInfo: {
      type: "table",
      data: [
        { key: "А", value: "01" },
        { key: "Д", value: "100" },
        { key: "К", value: "101" },
        { key: "Н", value: "10" },
        { key: "О", value: "111" },
        { key: "С", value: "000" },
      ],
    },
  },
  {
    id: 10,
    question:
      "От разведчика было получено следующее сообщение. \n \n **001001110110100** \n \n В этом сообщении зашифрован пароль  — последовательность русских букв. В пароле использовались только буквы А, Б, К, Л, О, С; каждая буква кодировалась двоичным словом по следующей таблице.",
    correctAnswer: "ОБЛАКО",
    additionalInfo: {
      type: "table",
      data: [
        { key: "А", value: "01" },
        { key: "Б", value: "100" },
        { key: "К", value: "101" },
        { key: "Л", value: "111" },
        { key: "О", value: "00" },
        { key: "С", value: "110" },
      ],
    },
  },
];

export const ogeTask10Questions = [
  {
    id: 1,
    question: "Переведи число 101101₂ в десятичную систему счисления.",
    correctAnswer: "45",
  },
  {
    id: 2,
    question:
      "Вычислите значение арифметического выражения: 10111101₂ + 1101₈ + 111₁₆. В ответе запишите десятичное число, основание системы счисления указывать не нужно.",
    correctAnswer: "1039",
  },
  {
    id: 3,
    question: "Переведи число 3A₁₆ в десятичную систему счисления.",
    correctAnswer: "58",
  },
  {
    id: 4,
    question: "Переведи число 110011₂ в шестнадцатеричную систему счисления.",
    correctAnswer: "33",
  },
  {
    id: 5,
    question:
      "Вычислите значение арифметического выражения: 11011111₂ + 1011₈ - 111₁₆. В ответе запишите десятичное число, основание системы счисления указывать не нужно.",
    correctAnswer: "471",
  },
  {
    id: 6,
    question: "Переведи число 11111111₂ в десятичную систему счисления.",
    correctAnswer: "255",
  },
  {
    id: 7,
    question: "Переведи число 255₁₀ в шестнадцатеричную систему счисления.",
    correctAnswer: "FF",
  },
  {
    id: 8,
    question:
      "Вычислите значение арифметического выражения: 10101111₂ + 1011₈ + 101₁₆. В ответе запишите десятичное число, основание системы счисления указывать не нужно.",
    correctAnswer: "953",
  },
  {
    id: 9,
    question: "Переведи число 1F₁₆ в двоичную систему счисления.",
    correctAnswer: "11111",
  },
  {
    id: 10,
    question:
      "Вычислите значение арифметического выражения: 110111₂ + 1011₈ + 110₁₆. В ответе запишите десятичное число, основание системы счисления указывать не нужно.",
    correctAnswer: "904",
  },
];

export const categoryQuestions = [
  {
    id: "data-size",
    title: "Колличественные параметры информационных объектов",
    level: "middle",
    tasks: ogeTask1Questions,
    theory: [
      "8 бит = 1 байт \n \n Объём текстового сообщения зависит от количества информации, приходящегося накодирование одного символа этого сообщения. \n \n Например: \n \n 1. В кодировке ASCII на 1 символ приходится 8 битов=1байт \n \n 2. В кодировке Unicode на 1 символ приходится 16 битов=2байта \n \n Последовательность действий для решения задания \n \n 1. Определить количество байтов, приходящихся на кодирование одного символа \n \n 2. Определить количество символов на которое уменьшился (увеличился) текст. \n \n 3. Определить количество символов для кодирования букв. Для этого вычестьколичество символов, приходящихся на знаки препинания и пробелы. \n \n 4. \n \n a. Если текст увеличился, найти соответствующее слово; \n b. Если текст уменьшился, записать длину слова.",
    ],
  },
  {
    id: "encode-decode-info",
    title: "Кодирование и декодирование информации",
    level: "middle",
    tasks: ogeTask2Questions,
    theory: [
      "Информация измеряется в битах и байтах: 1 байт = 8 бит.",
      "Бит — минимальная единица информации, которая может принимать два значения: 0 или 1.",
      "Файл, изображение или текст имеют размер в зависимости от количества символов или пикселей.",
      "Объем информации вычисляется по формуле: I = K × i, где K — количество объектов, i — количество информации на один объект.",
      "Для кодирования символов используют коды: ASCII, Unicode.",
    ],
  },
  {
    id: "log-expression",
    title: "Значение логического выражения",
    tasks: ogeTask3Questions,
    level: "hard",

    theory: [
      "Логическое выражение — выражение, которое может быть истинным (true) или ложным (false).",
      "Основные логические операции: И (AND), ИЛИ (OR), НЕ (NOT).",
      "AND возвращает true, если все операнды истинны.",
      "OR возвращает true, если хотя бы один операнд истинен.",
      "NOT меняет значение на противоположное.",
      "Логические выражения можно записывать с помощью таблиц истинности.",
    ],
  },
  {
    id: "formal-desc",
    title: "Формальные описания реальных объектов и процессов",
    level: "middle",
    tasks: ogeTask2Questions,
    theory: [
      "Информация измеряется в битах и байтах: 1 байт = 8 бит.",
      "Бит — минимальная единица информации, которая может принимать два значения: 0 или 1.",
      "Файл, изображение или текст имеют размер в зависимости от количества символов или пикселей.",
      "Объем информации вычисляется по формуле: I = K × i, где K — количество объектов, i — количество информации на один объект.",
      "Для кодирования символов используют коды: ASCII, Unicode.",
    ],
  },
  {
    id: "linear-algorithm",
    title: "Простой линейный алгоритм для формального исполнителя",
    level: "middle",
    tasks: ogeTask5Questions,
    theory: [
      "Информация измеряется в битах и байтах: 1 байт = 8 бит.",
      "Бит — минимальная единица информации, которая может принимать два значения: 0 или 1.",
      "Файл, изображение или текст имеют размер в зависимости от количества символов или пикселей.",
      "Объем информации вычисляется по формуле: I = K × i, где K — количество объектов, i — количество информации на один объект.",
      "Для кодирования символов используют коды: ASCII, Unicode.",
    ],
  },
  {
    id: "if-statement",
    title: "Программа с условным оператором",
    level: "middle",
    tasks: ogeTask2Questions,
    theory: [
      "Информация измеряется в битах и байтах: 1 байт = 8 бит.",
      "Бит — минимальная единица информации, которая может принимать два значения: 0 или 1.",
      "Файл, изображение или текст имеют размер в зависимости от количества символов или пикселей.",
      "Объем информации вычисляется по формуле: I = K × i, где K — количество объектов, i — количество информации на один объект.",
      "Для кодирования символов используют коды: ASCII, Unicode.",
    ],
  },
  {
    id: "inf-comm-tech",
    title: "Информационно-коммуникационные технологии",
    level: "middle",
    tasks: ogeTask2Questions,
    theory: [
      "Информация измеряется в битах и байтах: 1 байт = 8 бит.",
      "Бит — минимальная единица информации, которая может принимать два значения: 0 или 1.",
      "Файл, изображение или текст имеют размер в зависимости от количества символов или пикселей.",
      "Объем информации вычисляется по формуле: I = K × i, где K — количество объектов, i — количество информации на один объект.",
      "Для кодирования символов используют коды: ASCII, Unicode.",
    ],
  },
  {
    id: "boolean-queries",
    title: "Запросы для поисковых систем с использованием логических выражений",
    level: "middle",
    tasks: ogeTask8Questions,
    theory: [
      "Информация измеряется в битах и байтах: 1 байт = 8 бит.",
      "Бит — минимальная единица информации, которая может принимать два значения: 0 или 1.",
      "Файл, изображение или текст имеют размер в зависимости от количества символов или пикселей.",
      "Объем информации вычисляется по формуле: I = K × i, где K — количество объектов, i — количество информации на один объект.",
      "Для кодирования символов используют коды: ASCII, Unicode.",
    ],
  },
  {
    id: "diagram-analysis",
    title: "Анализирование информации, представленной в виде схем",
    level: "middle",
    tasks: ogeTask2Questions,
    theory: [
      "Информация измеряется в битах и байтах: 1 байт = 8 бит.",
      "Бит — минимальная единица информации, которая может принимать два значения: 0 или 1.",
      "Файл, изображение или текст имеют размер в зависимости от количества символов или пикселей.",
      "Объем информации вычисляется по формуле: I = K × i, где K — количество объектов, i — количество информации на один объект.",
      "Для кодирования символов используют коды: ASCII, Unicode.",
    ],
  },
  {
    id: "number-system",
    title: "Системы счисления",
    tasks: ogeTask10Questions,
    level: "easy",
    theory: [
      "Система счисления — способ записи чисел с помощью ограниченного набора символов.",
      // { link: "https://blablabla", type: "image" },
      "Двоичная система (основание 2) использует цифры 0 и 1.",
      "Восьмеричная система (основание 8) использует цифры от 0 до 7.",
      "Десятичная система (основание 10) использует цифры от 0 до 9.",
      "Шестнадцатеричная система (основание 16) использует цифры 0–9 и буквы A–F.",
      "Перевод чисел между системами счисления осуществляется делением на основание или суммой разрядов.",
    ],
  },
  {
    id: "os-text-search",
    title: "Использование поиска операционной системы и текстового редактора",
    tasks: ogeTask1Questions,
    level: "easy",
    theory: [
      "Система счисления — способ записи чисел с помощью ограниченного набора символов.",
      // { link: "https://blablabla", type: "image" },
      "Двоичная система (основание 2) использует цифры 0 и 1.",
      "Восьмеричная система (основание 8) использует цифры от 0 до 7.",
      "Десятичная система (основание 10) использует цифры от 0 до 9.",
      "Шестнадцатеричная система (основание 16) использует цифры 0–9 и буквы A–F.",
      "Перевод чисел между системами счисления осуществляется делением на основание или суммой разрядов.",
    ],
  },
  {
    id: "os-tools-useage",
    title: "Использование поисковых средств операционной системы",
    tasks: ogeTask1Questions,
    level: "easy",
    theory: [
      "Система счисления — способ записи чисел с помощью ограниченного набора символов.",
      // { link: "https://blablabla", type: "image" },
      "Двоичная система (основание 2) использует цифры 0 и 1.",
      "Восьмеричная система (основание 8) использует цифры от 0 до 7.",
      "Десятичная система (основание 10) использует цифры от 0 до 9.",
      "Шестнадцатеричная система (основание 16) использует цифры 0–9 и буквы A–F.",
      "Перевод чисел между системами счисления осуществляется делением на основание или суммой разрядов.",
    ],
  },
];

export const customTest = {
  id: "custom",
  
  tasks: [],
};
