export const ogeTask1Questions = [
  {
    id: 1,
    question: "Переведи число 101101₂ в десятичную систему счисления.",
    correctAnswer: "45",
  },
  {
    id: 2,
    question:
      "Вычислите значение арифметического выражения: 10111101₂ + 1101₈ + 111₁₆. В ответе запишите десятичное число, основание системы счисления указывать не нужно.",
    correctAnswer: "1039",
  },
  {
    id: 3,
    question: "Переведи число 3A₁₆ в десятичную систему счисления.",
    correctAnswer: "58",
  },
  // {
  //   id: 4,
  //   question: "Переведи число 110011₂ в шестнадцатеричную систему счисления.",
  //   correctAnswer: "33",
  // },
  // {
  //   id: 5,
  //   question:
  //     "Вычислите значение арифметического выражения: 11011111₂ + 1011₈ - 111₁₆. В ответе запишите десятичное число, основание системы счисления указывать не нужно.",
  //   correctAnswer: "471",
  // },
  // {
  //   id: 6,
  //   question: "Переведи число 11111111₂ в десятичную систему счисления.",
  //   correctAnswer: "255",
  // },
  // {
  //   id: 7,
  //   question: "Переведи число 255₁₀ в шестнадцатеричную систему счисления.",
  //   correctAnswer: "FF",
  // },
  // {
  //   id: 8,
  //   question:
  //     "Вычислите значение арифметического выражения: 10101111₂ + 1011₈ + 101₁₆. В ответе запишите десятичное число, основание системы счисления указывать не нужно.",
  //   correctAnswer: "953",
  // },
  // {
  //   id: 9,
  //   question: "Переведи число 1F₁₆ в двоичную систему счисления.",
  //   correctAnswer: "11111",
  // },
  // {
  //   id: 10,
  //   question:
  //     "Вычислите значение арифметического выражения: 110111₂ + 1011₈ + 110₁₆. В ответе запишите десятичное число, основание системы счисления указывать не нужно.",
  //   correctAnswer: "904",
  // },
];

export const ogeTask2Questions = [
  {
    id: 1,
    question:
      "В кодировке КОИ-8 каждый символ кодируется 8 битами. Андрей написал текст (в нем нет лишних пробелов):«Обь, Лена, Волга, Москва, Макензи, Амазонка  — реки».Ученик вычеркнул из списка название одной из рек. Заодно он вычеркнул ставшие лишними запятые и пробелы  — два пробела не должны идти подряд.При этом размер нового предложения в данной кодировке оказался на 8 байтов меньше, чем размер исходного предложения. Напишите в ответе вычеркнутое название реки.",
    correctAnswer: "Москва",
  },
  {
    id: 2,
    question:
      "В кодировке КОИ-8 каждый символ кодируется 8 битами. Андрей написал текст (в нем нет лишних пробелов):«Чад, Куба, Катар, Швеция, Эстония, Танзания, Сальвадор  — страны».Ученик вычеркнул из списка название одной из стран. Заодно он вычеркнул ставшие лишними запятые и пробелы  — два пробела не должны идти подряд.При этом размер нового предложения в данной кодировке оказался на 11 байтов меньше, чем размер исходного предложения. Напишите в ответе вычеркнутое название страны.",
    correctAnswer: "Сальвадор",
  },
  {
    id: 3,
    question:
      "В кодировке КОИ-8 каждый символ кодируется 8 битами. Паша написал текст (в нем нет лишних пробелов):«Аки, Бали, Банда, Сибуян, Камотес, Лабрадор, Линкольна  — моря».Ученик вычеркнул из списка название одного из морей. Заодно он вычеркнул ставшие лишними запятые и пробелы  — два пробела не должны идти подряд.При этом размер нового предложения в данной кодировке оказался на 7 байтов меньше, чем размер исходного предложения. Напишите в ответе вычеркнутое название моря.",
    correctAnswer: "Банда",
  },
  {
    id: 4,
    question:
      "В кодировке КОИ-8 каждый символ кодируется 8 битами. Лена написала текст (в нем нет лишних пробелов): \n «Ява, Куба, Лусон, Маражо, Суматра, Сулавеси, Эспаньола  — острова».Ученица вычеркнула из списка название одного из островов. Заодно она вычеркнула ставшие лишними запятые и пробелы  — два пробела не должны идти подряд.При этом размер нового предложения в данной кодировке оказался на 9 байтов меньше, чем размер исходного предложения. Напишите в ответе вычеркнутое название острова.",
    correctAnswer: "Суматра",
  },
  {
    id: 5,
    question:
      "В кодировке КОИ-8 каждый символ кодируется 8 битами. Аня написала текст (в нем нет лишних пробелов):«ерш, Щука, Бычок, Карась, Гимнура, Долгопер  — рыбы».Ученик вычеркнул из списка название одной из рыб. Заодно он вычеркнул ставшие лишними запятые и пробелы  — два пробела не должны идти подряд.При этом размер нового предложения в данной кодировке оказался на 10 байтов меньше, чем размер исходного предложения. Напишите в ответе вычеркнутое название рыбы.",
    correctAnswer: "Долгопер",
  },
];

export const ogeTask3Questions = [
  {
    id: 1,
    question:
      "Напишите наибольшее целое число x, для которого истинно высказывание: НЕ (X <= 15) И (X < 20).",
    correctAnswer: "19",
  },
  {
    id: 2,
    question:
      "Напишите наибольшее целое число x, для которого истинно высказывание: НЕ (X <= 10) И НЕ (X > 16).",
    correctAnswer: "16",
  },
  {
    id: 3,
    question:
      "Напишите наибольшее целое число x, для которого истинно высказывание: НЕ (X четное) И НЕ (X >= 7).",
    correctAnswer: "5",
  },
  {
    id: 4,
    question:
      "Напишите наибольшее целое число x, для которого истинно высказывание: НЕ (X нечетное) И НЕ (X >= 10).",
    correctAnswer: "8",
  },
  {
    id: 5,
    question:
      "Напишите наибольшее целое число x, для которого истинно высказывание: (X >= 6) И НЕ (X > 12).",
    correctAnswer: "12",
  },
];

export const categoryQuestions = [
  {
    id: "number-system",
    title: "Системы счисления",
    tasks: ogeTask1Questions,
    level: "easy",
    theory: [
      "Система счисления — способ записи чисел с помощью ограниченного набора символов.",
      // { link: "https://blablabla", type: "image" },
      "Двоичная система (основание 2) использует цифры 0 и 1.",
      "Восьмеричная система (основание 8) использует цифры от 0 до 7.",
      "Десятичная система (основание 10) использует цифры от 0 до 9.",
      "Шестнадцатеричная система (основание 16) использует цифры 0–9 и буквы A–F.",
      "Перевод чисел между системами счисления осуществляется делением на основание или суммой разрядов.",
    ],
  },
  {
    id: "2",
    title: "Колличественные параметры информационных объектов",
    level: "middle",
    tasks: ogeTask2Questions,
    theory: [
      "Информация измеряется в битах и байтах: 1 байт = 8 бит.",
      "Бит — минимальная единица информации, которая может принимать два значения: 0 или 1.",
      "Файл, изображение или текст имеют размер в зависимости от количества символов или пикселей.",
      "Объем информации вычисляется по формуле: I = K × i, где K — количество объектов, i — количество информации на один объект.",
      "Для кодирования символов используют коды: ASCII, Unicode.",
    ],
  },
  {
    id: "3",
    title: "Значение логического выражения",
    tasks: ogeTask3Questions,
    level: "hard",

    theory: [
      "Логическое выражение — выражение, которое может быть истинным (true) или ложным (false).",
      "Основные логические операции: И (AND), ИЛИ (OR), НЕ (NOT).",
      "AND возвращает true, если все операнды истинны.",
      "OR возвращает true, если хотя бы один операнд истинен.",
      "NOT меняет значение на противоположное.",
      "Логические выражения можно записывать с помощью таблиц истинности.",
    ],
  },
];

export const customTest = {
  id: "custom",
  title: "Custom Test",
  tasks: [],
};
